/** 工具更新日志 */
export const CHANGE_LOGS = {
  'json-formatter': [
    '[2] - 2025-02-07\n优化“输出内容”显示样式，解决内容较多时行号显示不全的问题。',
    '[1] - 2025-02-04\n初始版本。',
  ],
  'keep-screen-on': [
    '[3] - 2026-01-03\n调整界面样式，与其他模块统一。',
    '[2] - 2024-10-13\n优化界面样式，背景添加圆角。',
    '[1] - 2024-10-11\n初始版本。',
  ],
  'msu2-usb-monitor-controller': [
    '[2] - 2026-02-24\n完善功能：添加旧算法；支持设置显示方向；支持配置渲染间隔和发送间隔。',
    '[1] - 2026-02-21\n初始版本。',
  ],
  'qrcode-reader-and-generator': [
    '[2] - 2025-02-23\n支持生成二维码。\n支持解析剪贴板中的二维码图片。\n优化解析功能，在二维码所在位置添加矩形标记。',
    '[1] - 2025-02-21\n初始版本。',
  ],
};
